Hi  slevenick,

``` terraform plan```  give me this result:

```tf
Terraform will perform the following actions:
  # google_billing_budget.budget will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01D737-CD1044-XXXXXX"
      + display_name    = "Example Billing Budget"
      + id              = (known after apply)
      + name            = (known after apply)
      + amount {
          + specified_amount {
              + currency_code = "USD"
              + units         = "100000"
            }
        }
      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "EXCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = [
              + "projects/56756620XXXX",
            ]
          + services               = []
          + subaccounts            = (known after apply)
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 0.9
        }
    }

```
But with: ``` terraform apply```  I get the error mentioned above

I have checked that the service account used, it has the role **roles/billing.admin** at the organization level to create alerts 

I remain at your disposal for any further information.

Yassine

